tap 'buo/cask-upgrade'
tap 'homebrew/bundle'
tap 'keith/formulae'
tap 'marhaasa/tools'

brew 'git'
brew 'python@3.12'
brew 'wireguard-go'
brew 'wireguard-tools'
brew 'sqlcmd'
brew 'pyright'
brew 'azure-cli'
brew 'neovim'
brew 'bash-completion'
brew 'lazygit'
brew 'keith/formulae/reminders-cli'
brew 'marhaasa/tools/sage'
brew 'marhaasa/tools/scribe'
brew 'marhaasa/tools/weave'
brew 'docker'
brew 'gh'
brew 'git-delta'
brew 'fzf'
brew 'ripgrep'
brew 'fd'
brew 'starship'
brew 'node'
brew 'go'
brew 'rust'
brew 'poetry'
brew 'pipx'
brew 'bottom'
brew 'btop'
brew 'fastfetch'
brew 'entr'
brew 'tldr'
brew 'thefuck'
brew 'tree-sitter'
brew 'newsboat'
brew 'kubernetes-cli'
brew 'minikube'
brew 'ollama'
brew 'pure'
brew 'dockutil'
brew 'docker-compose'
brew 'postgresql'
brew 'uv'
brew 'jupyter'
brew 'jupyterlab'
brew 'black'

cask '1password'
cask '1password-cli'
cask 'discord'
cask 'obsidian'
cask 'amethyst'
cask 'arc'
cask 'microsoft-edge'
cask 'microsoft-excel'
cask 'microsoft-powerpoint'
cask 'microsoft-teams'
cask 'microsoft-word'
cask 'microsoft-onenote'
cask 'microsoft-outlook'
cask 'microsoft-remote-desktop'
cask 'slack'
cask 'docker'
cask 'firefox'
cask 'visual-studio-code'
cask 'azure-data-studio'
cask 'claude'
cask 'ghostty'
cask 'font-fira-code'
cask 'font-hack-nerd-font'
cask 'font-iosevka-term-nerd-font'
