tap 'buo/cask-upgrade'
tap 'homebrew/bundle'

brew 'git'
brew 'python@3.11'
brew 'wireguard-go'
brew 'wireguard-tools'
brew 'sqlcmd'
brew 'pyright'
brew 'azure-cli'
brew 'neovim'
brew 'bash-completion'
brew 'tmux'
brew 'lazygit'

cask '1password'
cask '1password-cli'
cask 'alacritty'
cask 'discord'
cask 'utm'
cask 'crystalfetch'
cask 'obsidian'
cask 'amethyst'
cask 'arc'
cask 'microsoft-excel'
cask 'microsoft-powerpoint'
cask 'microsoft-teams'
cask 'microsoft-word'
cask 'microsoft-onenote'
cask 'microsoft-outlook'
cask 'microsoft-remote-desktop'
cask 'slack'



tap 'buo/cask-upgrade'
