tap "buo/cask-upgrade"
tap "graelo/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "keith/formulae"
tap "microsoft/mssql-release"
brew "asciiquarium"
brew "python@3.11"
brew "azure-cli"
brew "bash"
brew "bash-completion"
brew "fd"
brew "fzf"
brew "git"
brew "gh"
brew "lazygit"
brew "neovim"
brew "newsboat"
brew "node"
brew "ollama", restart_service: true
brew "pyright"
brew "python@3.12"
brew "ripgrep"
brew "sqlcmd"
brew "starship"
brew "tmux"
brew "wireguard-go"
brew "wireguard-tools"
brew "keith/formulae/reminders-cli"
brew "microsoft/mssql-release/mssql-tools18", link: false
cask "1password"
cask "1password-cli"
cask "alacritty"
cask "amethyst"
cask "arc"
cask "azure-data-studio"
cask "crystalfetch"
cask "discord"
cask "docker"
cask "microsoft-auto-update"
cask "microsoft-excel"
cask "microsoft-onenote"
cask "microsoft-outlook"
cask "microsoft-powerpoint"
cask "microsoft-remote-desktop"
cask "microsoft-teams"
cask "microsoft-word"
cask "obsidian"
cask "parallels"
cask "postman"
cask "slack"
cask "stats"
cask "utm"
cask "visual-studio-code"
vscode "formulahendry.dotnet"
vscode "ms-azuretools.vscode-azurefunctions"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "piotrgredowski.poor-mans-t-sql-formatter-pg"
vscode "redhat.vscode-yaml"
vscode "synapsevscode.synapse"
